Revit 2026 API

# AdvancedOpaqueOpaqueMfp Property

---

The property labeled "Translucency Depth" from the "AdvancedOpaque" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string OpaqueMfp { get; }
```
```vb
Public Shared ReadOnly Property OpaqueMfp As String
	Get
```
```cpp
public:
static property String^ OpaqueMfp {
	String^ get ();
}
```
```fsharp
static member OpaqueMfp : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDistance".

#### Reference

AdvancedOpaque Class

Autodesk.Revit.DB.Visual Namespace